First, import the library required for this part.

In [48]:
import pandas as pd

Import the main information for each title.

In [49]:
info = pd.read_csv('raw_data/title_info_og.csv')

In [50]:
info.head()

,id,title,type,description,release_year,age_certification,runtime,genres,production_countries,seasons,imdb_id,imdb_score,imdb_votes,tmdb_popularity,tmdb_score
0,ts300399,Five Came Back: The Reference Films,SHOW,This collection includes 12 World War II-era p...,1945,TV-MA,51,['documentation'],['US'],1.0,NaN,NaN,NaN,0.600,NaN
1,tm84618,Taxi Driver,MOVIE,A mentally unstable Vietnam War veteran works ...,1976,R,114,"['drama', 'crime']",['US'],NaN,tt0075314,8.2,808582.0,40.965,8.179
2,tm154986,Deliverance,MOVIE,Intent on seeing the Cahulawassee River before...,1972,R,109,"['drama', 'action', 'thriller', 'european']",['US'],NaN,tt0068473,7.7,107673.0,10.010,7.300
3,tm127384,Monty Python and the Holy Grail,MOVIE,"King Arthur, accompanied by his squire, recrui...",1975,PG,91,"['fantasy', 'action', 'comedy']",['GB'],NaN,tt0071853,8.2,534486.0,15.461,7.811
4,tm120801,The Dirty Dozen,MOVIE,12 American military prisoners in World War II...,1967,NaN,150,"['war', 'action']","['GB', 'US']",NaN,tt0061578,7.7,72662.0,20.398,7.600

In [51]:
info.shape

(5850, 15)

Now, let's import the data for the credits.

In [52]:
credits = pd.read_csv('raw_data/title_credits.csv')

In [53]:
credits.head()

   person_id       id             name                character   role
0       3748  tm84618   Robert De Niro            Travis Bickle  ACTOR
1      14658  tm84618     Jodie Foster            Iris Steensma  ACTOR
2       7064  tm84618    Albert Brooks                      Tom  ACTOR
3       3739  tm84618    Harvey Keitel  Matthew 'Sport' Higgins  ACTOR
4      48933  tm84618  Cybill Shepherd                    Betsy  ACTOR

In [54]:
credits['role'].value_counts()

ACTOR       73251
DIRECTOR     4550
Name: role, dtype: int64

I need to create two fields in the final info dataframe: actors and director.

For ease, let's split the credits on actors and directors.

In [55]:
actors = credits[credits['role'] == 'ACTOR']

In [56]:
actors.shape[0]

73251

In [57]:
directors = credits[credits['role'] == 'DIRECTOR']

In [58]:
directors.shape[0]

4550

Now let's merge either with the initial info dataframe to create a final info dataframe.

In [59]:
first_merge = pd.merge(info, actors.groupby('id')['name'].apply(list).reset_index(), on='id', how='left')

In [60]:
first_merge.rename(columns={"name": "actors"}, inplace=True)

In [61]:
first_merge.head()

,id,title,type,description,release_year,age_certification,runtime,genres,production_countries,seasons,imdb_id,imdb_score,imdb_votes,tmdb_popularity,tmdb_score,actors
0,ts300399,Five Came Back: The Reference Films,SHOW,This collection includes 12 World War II-era p...,1945,TV-MA,51,['documentation'],['US'],1.0,NaN,NaN,NaN,0.600,NaN,NaN
1,tm84618,Taxi Driver,MOVIE,A mentally unstable Vietnam War veteran works ...,1976,R,114,"['drama', 'crime']",['US'],NaN,tt0075314,8.2,808582.0,40.965,8.179,"[Robert De Niro, Jodie Foster, Albert Brooks, ..."
2,tm154986,Deliverance,MOVIE,Intent on seeing the Cahulawassee River before...,1972,R,109,"['drama', 'action', 'thriller', 'european']",['US'],NaN,tt0068473,7.7,107673.0,10.010,7.300,"[Jon Voight, Burt Reynolds, Ned Beatty, Ronny ..."
3,tm127384,Monty Python and the Holy Grail,MOVIE,"King Arthur, accompanied by his squire, recrui...",1975,PG,91,"['fantasy', 'action', 'comedy']",['GB'],NaN,tt0071853,8.2,534486.0,15.461,7.811,"[Graham Chapman, John Cleese, Eric Idle, Terry..."
4,tm120801,The Dirty Dozen,MOVIE,12 American military prisoners in World War II...,1967,NaN,150,"['war', 'action']","['GB', 'US']",NaN,tt0061578,7.7,72662.0,20.398,7.600,"[Lee Marvin, Ernest Borgnine, Charles Bronson,..."

In [62]:
res = pd.merge(first_merge, directors.groupby('id')['name'].apply(list).reset_index(), on='id', how='left')

In [63]:
res.rename(columns={"name": "directors"}, inplace=True)

In [64]:
res.head()

,id,title,type,description,release_year,age_certification,runtime,genres,production_countries,seasons,imdb_id,imdb_score,imdb_votes,tmdb_popularity,tmdb_score,actors,directors
0,ts300399,Five Came Back: The Reference Films,SHOW,This collection includes 12 World War II-era p...,1945,TV-MA,51,['documentation'],['US'],1.0,NaN,NaN,NaN,0.600,NaN,NaN,NaN
1,tm84618,Taxi Driver,MOVIE,A mentally unstable Vietnam War veteran works ...,1976,R,114,"['drama', 'crime']",['US'],NaN,tt0075314,8.2,808582.0,40.965,8.179,"[Robert De Niro, Jodie Foster, Albert Brooks, ...",[Martin Scorsese]
2,tm154986,Deliverance,MOVIE,Intent on seeing the Cahulawassee River before...,1972,R,109,"['drama', 'action', 'thriller', 'european']",['US'],NaN,tt0068473,7.7,107673.0,10.010,7.300,"[Jon Voight, Burt Reynolds, Ned Beatty, Ronny ...",[John Boorman]
3,tm127384,Monty Python and the Holy Grail,MOVIE,"King Arthur, accompanied by his squire, recrui...",1975,PG,91,"['fantasy', 'action', 'comedy']",['GB'],NaN,tt0071853,8.2,534486.0,15.461,7.811,"[Graham Chapman, John Cleese, Eric Idle, Terry...","[Terry Jones, Terry Gilliam]"
4,tm120801,The Dirty Dozen,MOVIE,12 American military prisoners in World War II...,1967,NaN,150,"['war', 'action']","['GB', 'US']",NaN,tt0061578,7.7,72662.0,20.398,7.600,"[Lee Marvin, Ernest Borgnine, Charles Bronson,...",[Robert Aldrich]

In [65]:
res.shape

(5850, 17)

Now, let's output this data into a csv file for later usage.

In [66]:
res.to_csv('raw_data/title_info.csv')

Now, let's import the titles that we will be using for the analysis, due to the existence of the date added to Netflix.

In [67]:
titles = pd.read_csv('raw_data/titles.csv')

In [68]:
titles['date_added'] = pd.to_datetime(titles['date_added'])

In [69]:
titles['year_added'] = titles['date_added'].dt.year

In [70]:
titles['year_added'].isna().value_counts()

False    8797
True       10
Name: year_added, dtype: int64

In [71]:
titles.dropna(subset=['year_added'], inplace=True)

In [72]:
titles['year_added'].isna().value_counts()

False    8797
Name: year_added, dtype: int64

In [73]:
titles['year_added'] = titles['year_added'].astype('int')

In [74]:
titles['month_added'] = titles['date_added'].dt.strftime('%B')

In [75]:
titles['month_added'].isna().value_counts()

False    8797
Name: month_added, dtype: int64

In [76]:
titles['year_month_added'] = titles['date_added'].dt.strftime('%B, %Y')

In [77]:
titles['year_month_added'].isna().value_counts()

False    8797
Name: year_month_added, dtype: int64

In [78]:
titles.head()

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description,year_added,month_added,year_month_added
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,2021-09-25,2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm...",2021,September,"September, 2021"
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,2021-09-24,2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t...",2021,September,"September, 2021"
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,2021-09-24,2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act...",To protect his family from a powerful drug lor...,2021,September,"September, 2021"
3,s4,TV Show,Jailbirds New Orleans,NaN,NaN,NaN,2021-09-24,2021,TV-MA,1 Season,"Docuseries, Reality TV","Feuds, flirtations and toilet talk go down amo...",2021,September,"September, 2021"
4,s5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,2021-09-24,2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ...",In a city of coaching centers known to train I...,2021,September,"September, 2021"

In [79]:
titles['year_added'].value_counts()

2019    2016
2020    1879
2018    1649
2021    1498
2017    1188
2016     429
2015      82
2014      24
2011      13
2013      11
2012       3
2009       2
2008       2
2010       1
Name: year_added, dtype: int64

I will subset the data to 2016-2021 because the other years don't have enough titles for relevant analysis.

In [80]:
year_condition = (titles['year_added'] >= 2016) & (titles['year_added'] <= 2021)

In [81]:
titles = titles[year_condition]

Now, I will subset both the `res` and `titles` dataframe for easy merging.

In [82]:
titles_subset = titles[['title', 'country', 'release_year', 'rating', 'duration', 'description', 'year_added', 'month_added', 'year_month_added']]

In [83]:
titles_subset.head()

,title,country,release_year,rating,duration,description,year_added,month_added,year_month_added
0,Dick Johnson Is Dead,United States,2020,PG-13,90 min,"As her father nears the end of his life, filmm...",2021,September,"September, 2021"
1,Blood & Water,South Africa,2021,TV-MA,2 Seasons,"After crossing paths at a party, a Cape Town t...",2021,September,"September, 2021"
2,Ganglands,NaN,2021,TV-MA,1 Season,To protect his family from a powerful drug lor...,2021,September,"September, 2021"
3,Jailbirds New Orleans,NaN,2021,TV-MA,1 Season,"Feuds, flirtations and toilet talk go down amo...",2021,September,"September, 2021"
4,Kota Factory,India,2021,TV-MA,2 Seasons,In a city of coaching centers known to train I...,2021,September,"September, 2021"

In [84]:
titles_subset.shape

(8659, 9)

In [85]:
titles_subset.isna().value_counts()

title  country  release_year  rating  duration  description  year_added  month_added  year_month_added
False  False    False         False   False     False        False       False        False               7826
       True     False         False   False     False        False       False        False                826
       False    False         False   True      False        False       False        False                  3
                              True    False     False        False       False        False                  3
       True     False         True    False     False        False       False        False                  1
dtype: int64

In [86]:
info_subset = res[['title', 'imdb_score', 'genres', 'actors', 'directors']]

In [87]:
info_subset.shape

(5850, 5)

In [88]:
info_subset = info_subset[(info_subset['imdb_score'].isna() == False)]

In [89]:
info_subset.shape

(5368, 5)

Now, let's merge the two subsets to see all of the matched information.

In [90]:
temp = pd.merge(titles_subset, info_subset, on='title', how='left')

In [91]:
na_counts = temp.isna().sum()
na_counts = na_counts[na_counts > 0]
display(na_counts.to_frame(name='Missing Values'))

            Missing Values
country                831
rating                   4
duration                 3
imdb_score            5036
genres                5036
actors                5318
directors             6234

In [92]:
temp.dropna(subset=['genres']).shape

(3663, 13)

But, before confirming that I want to drop all values without genres and imdb scores for analysis, I want to explore more about the remaining data.

In [93]:
temp.dropna(subset=['genres']).year_added.value_counts()

2020    1032
2021     878
2019     737
2018     569
2017     321
2016     126
Name: year_added, dtype: int64

That's a lot of data to be left out of the analysis, so, I will consider these non-null genre and imdb score data when they are relevant to any visualizations.

In [95]:
temp.to_csv('data/titles.csv', index=False)

Now, let's import the stocks data frame just to subset the data there.

In [98]:
stocks = pd.read_csv('raw_data/stock.csv')

In [99]:
stocks.head()

         Date      Open      High       Low     Close  Adj Close     Volume
0  2002-05-23  1.156429  1.242857  1.145714  1.196429   1.196429  104790000
1  2002-05-24  1.214286  1.225000  1.197143  1.210000   1.210000   11104800
2  2002-05-28  1.213571  1.232143  1.157143  1.157143   1.157143    6609400
3  2002-05-29  1.164286  1.164286  1.085714  1.103571   1.103571    6757800
4  2002-05-30  1.107857  1.107857  1.071429  1.071429   1.071429   10154200

In [100]:
stocks['Date'] = pd.to_datetime(stocks['Date'])

In [104]:
stocks['Year'] = stocks['Date'].dt.year

In [105]:
stocks['Month'] = stocks['Date'].dt.strftime('%B')

In [106]:
stocks['Year-Month'] = stocks['Date'].dt.strftime('%B, %Y')

In [108]:
stocks = stocks[(stocks['Year'] >= 2016) & (stocks['Year'] <= 2021)]

In [110]:
stocks.head()

,Date,Open,High,Low,Close,Adj Close,Volume,Year,Month,Year-Month
3427,2016-01-04,109.000000,110.000000,105.209999,109.959999,109.959999,20794800,2016,January,"January, 2016"
3428,2016-01-05,110.449997,110.580002,105.849998,107.660004,107.660004,17664600,2016,January,"January, 2016"
3429,2016-01-06,105.290001,117.910004,104.959999,117.680000,117.680000,33045700,2016,January,"January, 2016"
3430,2016-01-07,116.360001,122.180000,112.290001,114.559998,114.559998,33636700,2016,January,"January, 2016"
3431,2016-01-08,116.330002,117.720001,111.099998,111.389999,111.389999,18067100,2016,January,"January, 2016"

In [113]:
stocks.to_csv('data/stocks.csv', index=False)